{
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-EMAIL",
    "2": "I-EMAIL",
    "3": "L-EMAIL",
    "4": "U-EMAIL",
    "5": "B-PHONE",
    "6": "I-PHONE",
    "7": "L-PHONE",
    "8": "U-PHONE",
    "9": "B-SSN",
    "10": "I-SSN",
    "11": "L-SSN",
    "12": "U-SSN",
    "13": "B-CREDIT_CARD",
    "14": "I-CREDIT_CARD",
    "15": "L-CREDIT_CARD",
    "16": "U-CREDIT_CARD",
    "17": "B-PERSON",
    "18": "I-PERSON",
    "19": "L-PERSON",
    "20": "U-PERSON",
    "21": "B-ORG",
    "22": "I-ORG",
    "23": "L-ORG",
    "24": "U-ORG",
    "25": "B-ADDRESS",
    "26": "I-ADDRESS",
    "27": "L-ADDRESS",
    "28": "U-ADDRESS",
    "29": "B-DATE",
    "30": "I-DATE",
    "31": "L-DATE",
    "32": "U-DATE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ADDRESS": 25,
    "B-CREDIT_CARD": 13,
    "B-DATE": 29,
    "B-EMAIL": 1,
    "B-ORG": 21,
    "B-PERSON": 17,
    "B-PHONE": 5,
    "B-SSN": 9,
    "I-ADDRESS": 26,
    "I-CREDIT_CARD": 14,
    "I-DATE": 30,
    "I-EMAIL": 2,
    "I-ORG": 22,
    "I-PERSON": 18,
    "I-PHONE": 6,
    "I-SSN": 10,
    "L-ADDRESS": 27,
    "L-CREDIT_CARD": 15,
    "L-DATE": 31,
    "L-EMAIL": 3,
    "L-ORG": 23,
    "L-PERSON": 19,
    "L-PHONE": 7,
    "L-SSN": 11,
    "O": 0,
    "U-ADDRESS": 28,
    "U-CREDIT_CARD": 16,
    "U-DATE": 32,
    "U-EMAIL": 4,
    "U-ORG": 24,
    "U-PERSON": 20,
    "U-PHONE": 8,
    "U-SSN": 12
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
